loadtest-popular.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 1
    - duration: 120
      arrivalRate: 1
      rampTo: 5
    - duration: 600
      arrivalRate: 10      
  payload:
    path: "./loadtesting/popular.csv"
    fields: 
      - "popular"
scenarios:
  - name: "Serve popular listings"
    flow:
      - loop: 
        - get:
          url: "/rooms/{{ popular }}"  
          count: 30
        # - get:
        #   url: "/reviews"
        #   body: "locationId={{ popular }}"